tutorial/app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "dskadksla"], ["text", "kjsakjsakjsal"], ["created_at", "2015-08-25 15:53:09.021942"], ["updated_at", "2015-08-25 15:53:09.021942"]]
---
  def create
    @article = Article.new(article_params)
    # params[:article] : hash, form fields values
    if @article.save