tutorial/app/controllers/comments_controller.rb

  def create
    @article = Article.find(params[:article_id])
    @comment = @article.comments.create(comment_params)
    if @comment.errors.any?
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 3]]
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "dsamdmsaömdaösç"], ["body", "skalkslaksşlakş"], ["article_id", 3], ["created_at", "2015-08-25 15:53:13.637453"], ["updated_at", "2015-08-25 15:53:13.637453"]]
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 3]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 3]]